<template>
  <div class="menu">
    <ul>
      <li v-for="(link, index) in   menuLinks  " :key="index">
        <a class="menuLinks" v-for="(name, index) in  link " :key="name.id" :href="'/#/' + index">{{ index }}
          <ul>
            <li class="menuLinksChild" v-for="( name ) in  name " :key="name.id">
              <a :href="'/#/catalog'">{{ name }}</a>
            </li>
          </ul>
        </a>
      </li>
    </ul>
  </div>
</template>

<script>
export default {
  name: "v-menu",
  data() {
    return {
      menuLinks: [
        {
          "Авто товары": [
            "FM-трансмиттеры",
            "GPS-навигаторы",
            "LED-лампы",
            "Авто-аксессуары",
            "Автоакустика",
            "Автоантенны",
            "Автокомпрессоры",
            "Автокресла",
            "Автомагнитолы",
            "Автопылесосы",
            "Автохолодильники",
            "Алкотестеры",
            "Домкраты, насосы, манометры",
            "ДХО",
            "Зарядные устройства и разветвители",
            "Зимние аксессуары",
            "Коврики",
            "Ксенон",
            "Парктроники и камеры",
            "Провода для запуска",
            "Пуско-зарядные устройства",
            "Радар-детекторы",
            "Сабвуферы",
            "Сигнализации",
            "Стеклоподъемники",
            "Телевизоры автомобильные",
            "Тросы и стяжки",
            "Усилители",
            "Чехлы и майки"
          ]
        },
        {
          "Аудио-видео техника": [
            'Акустика',
            'Антенны',
            'Крепления и кронштейны',
            'Магнитоллы',
            'Микрофоны',
            'Музыкальные центры',
            'Мультимедийные плееры',
            'Плееры и Диктофоны',
            'Проекторы',
            'Радиоприемники',
            'Телевизоры',
            'Универсальные пульты ДУ',
            'Цифровые ТВ-приставки'
          ]
        },
        {
          "Крупнобытовая техника": [
            "Морозильные камеры",
            "Холодильники",
            "Стиральные машины",
            "Посудомоечные машины",
            "Газовые плиты",
            "Индукционные и электрические плитки",
            "Водонагреватели",
            "Вытяжки",
            "Сушильные машины",
            "Центрифуги"
          ]
        },
        {
          "Компьютерная техника": [
            'IP-камеры',
            'USB-хабы',
            'Web-камеры',
            'Внешние диски',
            'Геймпады и джойстики',
            'ИБП, Стабилизаторы, Сетевые фильтры',
            'Картридеры',
            'Картриджи и аксессуары',
            'Клавиатуры и комплекты',
            'Коврики',
            'Колонки',
            'Комплектующие',
            'Мониторы',
            'Моноблоки',
            'МФУ, Принтеры, Копиры',
            'Мыши',
            'Наушники',
            'Носители информации',
            'Сетевое оборудование',
            'Сетевые хранилища',
            'Системные блоки'
          ]
        },
        {
          "Техника для дома": [
            'Будильники',
            'Вентиляторы',
            'Гладильные доски',
            'Гладильные и паровые станции',
            'Машинки для удаления катышков',
            'Метеостанции',
            'Пылесосы',
            'Свет для дискотек',
            'Синтезаторы',
            'Сплит-системы',
            'Сушилки для белья',
            'Сушилки для обуви',
            'Утюги',
            'Швейные машины'
          ]
        },
        {
          "Сад и огород дача": [
            'Автоклавы и дистилляторы',
            'Воздуходувки',
            'Газонокосилки',
            'Дачная мебель',
            'Для полива',
            'Зернодробилки',
            'Зонты',
            'Инкубаторы',
            'Кемпинговая мебель',
            'Кемпинговые фонари',
            'Культиваторы и мотоблоки',
            'Мангалы и коптильни',
            'Маслобойки',
            'Мотобуры',
            'Опрыскиватели',
            'Оснастка для триммеров',
            'Пластиковая мебель',
            'Посуда для пикника',
            'Садовый декор',
            'Садовый инструмент',
            'Тачки садовые',
            'Тележки и сумки',
            'Тенты и шатры',
            'Фермерские товары'
          ]
        },
        {
          "Спорт и отдых": [
            'Бадминтон и теннис',
            'Бассейны',
            'Батуты',
            'Бинокли',
            'Велосипеды',
            'Гироскутеры',
            'Лодки',
            'Матрацы и круги',
            'Палатки',
            'Подзорные трубы',
            'Самокаты',
            'Санки и снегокаты',
            'Телескопы',
            'Тюбинги (ватрушки)'
          ]
        }
      ],
    }
  }
}
</script>

<style lang="sass">
.menu
  width: 100%
  margin-top: auto
  ul
    display: flex
    justify-content: space-between
    justify-content: center
    align-items: center
    padding: 0
    box-shadow: 8px 0px 61px 8px #0024ff
    transition: all 3s ease
    li
      list-style: none
      padding: 10px 15px
      background: rgba(0, 0, 255, .1)
      &:not(:last-child)
        border-right: 1px solid #fff
      a.menuLinks
        color: #fff
        text-decoration: none
        padding: 5px 10px
        position: relative
        display: block
        position: relative
        &:hover
          ul
            visibility: visible
            transition: all 3s ease
        ul
          position: absolute
          top: 40px
          left: 0
          flex-direction: column
          // width: 25vw
          align-items: flex-start
          background: rgba(255, 255, 255, .7)
          transition: .3s ease
          visibility: hidden
          transition: all .3s ease
          padding-bottom: 10px
          li.menuLinksChild
            width: 100%
            text-align: left


</style>